<?php
// Heading
$_['heading_title']     = 'Обновление';
$_['heading_success']   = 'Обновление успешно завершено!';

// Text
$_['text_upgrade']      = 'Подготовка к обновлению';
$_['text_server']       = 'Проверьте настройки вашего сервера';
$_['text_steps']        = 'Прогресс обновления';
$_['text_error']        = 'Сообщайте о любых проблемах с ошибками сценария обновления на форумах.';
$_['text_clear']        = 'После обновления очистите все файлы cookie в браузере, чтобы избежать ошибок токена.';
$_['text_admin']        = 'Загрузите страницу администратора и дважды нажмите Ctrl+F5, чтобы браузер обновил изменения css.';
$_['text_user']         = 'Перейдите к Admin -> Users -> User Groups и отредактируйте группу Top Adminstrator. Установите все флажки.';
$_['text_setting']      = 'Перейдите к администратору и отредактируйте основные настройки системы. Обновите все поля и нажмите «Сохранить», даже если ничего не изменилось.';
$_['text_store']        = 'Загрузите витрину магазина и дважды нажмите Ctrl+F5, чтобы заставить браузер обновить изменения css.';
$_['text_progress']     = 'Исправление %s было применено (%s из %s)';
$_['text_success']      = 'Поздравляем! Обновления opencart успешно установлены.';

// Entry
$_['entry_progress']    = 'Прогресс';

// Error
$_['error_admin']       = 'Ошибка: файл конфигурации %s не найден. Убедитесь, что каталог администратора имеет правильное имя!';
$_['error_file']        = 'Ошибка: файл конфигурации %s не найден!';
$_['error_writable']    = 'Ошибка: файл конфигурации %s недоступен для записи!';
$_['error_upgrade']     = 'Ошибка: файлы обновления не установлены!';
$_['error_server']      = 'Ошибка: HTTP_SERVER constant could not be found!';
$_['error_db_driver']   = 'Ошибка: константа DB_DRIVER не найдена!';
$_['error_db_hostname'] = 'Ошибка: константа DB_HOSTNAME не найдена!';
$_['error_db_username'] = 'Ошибка: константа DB_USERNAME не найдена!';
$_['error_db_password'] = 'Ошибка: константа DB_PASSWORD не найдена!';
$_['error_db_database'] = 'Ошибка: константа DB_DATABASE не найдена!';
$_['error_db_port']     = 'Ошибка: константа DB_PORT не найдена!';
$_['error_db_prefix']   = 'Ошибка: константа DB_PREFIX не найдена!';