<?php
// Heading
$_['heading_title']          = 'Конфигурация';

// Text
$_['text_step_3']            = 'Данные для подключения к базе данных';
$_['text_db_connection']     = '1. Пожалуйста, введите данные для подключения к базе данных.';
$_['text_db_administration'] = '2. Пожалуйста, введите имя пользователя и пароль администратора.';
$_['text_mysqli']            = 'MySQLi';
$_['text_pdo']               = 'mPDO';
$_['text_pgsql']             = 'PostgreSQL';
$_['text_help']              = 'Информация о настройке баз данных на разных платформах:';
$_['text_cpanel']            = 'CPanel DB Setup';
$_['text_plesk']             = 'Plesk DB Setup';

// Entry
$_['entry_db_driver']        = 'DB Driver';
$_['entry_db_hostname']      = 'Хост';
$_['entry_db_username']      = 'Имя пользователя';
$_['entry_db_password']      = 'Пароль';
$_['entry_db_database']      = 'Имя базы данных';
$_['entry_db_port']          = 'Порт';
$_['entry_db_prefix']        = 'Префикс для таблиц';
$_['entry_username']         = 'Логин администратора';
$_['entry_password']         = 'Пароль администратора';
$_['entry_email']            = 'E-Mail';

// Error
$_['error_db_driver']        = 'Требуется драйвер базы данных!';
$_['error_db_hostname']      = 'Имя хоста не заполнено!';
$_['error_db_username']      = 'Имя пользователя БД не заполнено!';
$_['error_db_database']      = 'Имя базы данных не заполнено!';
$_['error_db_port']          = 'Порт для подключения не указан!';
$_['error_db_prefix']        = 'Префикс БД может содержать только символы нижнего регистра в диапазоне az, 0-9 и символы подчеркивания.';
$_['error_db_password']      = 'Пароль для полключения к базе данных не указан!';
$_['error_db_connect']       = 'Ошибка: Не удалось подключиться к базе данных. Убедитесь, что сервер базы данных, имя пользователя и пароль указаны правильно!';
$_['error_username']         = 'Логин администратора не задано!';
$_['error_password']         = 'Пароль администратора не задан!';
$_['error_email']            = 'Адрес электронной почты недействителен!';
$_['error_config']           = 'Ошибка: Не удалось записать в config.php, проверьте, правильно ли вы установили права доступа: ';
